session03/lab03.org
#+TITLE:  Computer Science Fundamentals
#+AUTHOR: Detroit Labs Dev Coaching
#+DATE:   2018
#+EMAIL:  ndotz@detroitlabs.com
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   skip:nil d:nil todo:t pri:nil tags:not-in-toc timestamp:nil
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+REVEAL_PLUGINS: (highlight notes)
#+REVEAL_THEME: league
#+REVEAL_MARGIN: 0.2
# #+REVEAL_MIN_SCALE: 0.5
# #+REVEAL_MAX_SCALE: 2.5
#+REVEAL_EXTRA_CSS: ./presentation.css

* Lab 3
  #+BEGIN_NOTES
  - Strings
  - Pointers
  - Bit-wise Operations
  - Enumerations
  #+END_NOTES
* Strings
** Strings vs Chars
   #+BEGIN_NOTES
   - You might be familiar with how we designate strings from other
     languages, which is done with the double-quote.
   - As we've seen a few times but have not belabored, this is
     distinct from defining a single character, which is done with the
     single-quote.
   - It's important to note that even a single character in a string
     is not the same as a char variable definition containing the same
     character.
   - More confounding is that assigning a string to a char variable
     will compile, and hopefully we'll understand why that is
     acceptable shortly. This does generate a warning but is still a
     potential point of confusion.
   #+END_NOTES
   #+BEGIN_SRC c
   "C is weird"  /* string */
   'c'           /* char   */
   "C"           /* string */

   char c = "c"; /* this compiles but probably
                    isn't what you intended!   */
   #+END_SRC c
** Strings are char[]
   #+BEGIN_NOTES
   - So, what is the type for a string? We can define a string literal
     by placing whatever characters we would like in the string
     between double-quotes, but there is no built-in string type in C.
   - The actual type we need to assign a string literal to is an array
     of characters.
   #+END_NOTES
   #+BEGIN_SRC c
   char d[] = "Detroit";
   #+END_SRC
** String sizes and '\0'
   #+BEGIN_NOTES
   - When we declare a string to be a character array, we're actually
     getting a bit of compiler magic to work for us.
   - When we assign a string to a character array, the compiler adds
     an additional null character to the end of the string if there is
     room in the array. This null character is used by convention to
     mark the end of a string and is used by library functions like
     printf to know when to stop functioning on values.
   - This is why you will usually see string literals defined as a
     non-specific size.
   - If explicitly defining the size of a character array to hold a
     string, be sure to leave an additional character's worth of space
     in the array's size to take full advantage of the compiler's
     special treatment for strings.
   #+END_NOTES
   #+BEGIN_SRC c
   char d[8] = { 'D', 'e', 't', 'r', 'o', 'i', 't', '\0' };
   #+END_SRC
** String Equality
   #+BEGIN_NOTES
   - If you're used to more fully-featured languages, you'll be
     disappointed to know that comparing strings can't be accomplished
     with the equality operator for numbers.
   - This is because even if they contain the same data, or even the
     same first element, arrays will never evaluate as the same from
     via the number equality operator.
   #+END_NOTES
   #+BEGIN_SRC c
    char c[] = "cat";
    char c2[] = "cat";
    if (c == c2) {
        printf("match\n");
    }  else {
        printf("no match\n");  /* cannot compare arrays! */
    }
   #+END_SRC
** Null String
   #+BEGIN_NOTES
   - This is, of course, except for the null string.
   - The null string is a string containing only the special null
     character, which is the default for an empty string assigned to a
     character array of unspecified length. The null string will
     compare correctly with a char representing the null character,
     which we'll understand more in a moment when we talk about pointers.
   #+END_NOTES
   #+BEGIN_SRC c
    char c[] = "";
    char c2 = '\0';
    if (c[0] == c2) {
        printf("match\n");
    }  else {
        printf("no match\n");
    }
   #+END_SRC
** Escape Characters
   #+BEGIN_NOTES
   - The null character is not the only special character available,
     it is one of several escape characters available, each of which
     is prefaced by the backslash.
   - The backslash itself is an escape character, and thus if we want
     to represent a literal backslash in a string, we can do so by
     prefacing it with a backslash.
   - We can also use the backslash to escape a single-quote to
     define a character representing a single-quote, or to escape
     double-quotes that we would like to show up as literals in a string.
   #+END_NOTES
   #+BEGIN_SRC c
   char newline = '\n';
   char about_newline[] = "the newline character is \\n";

   char sing_quo = '\'';
   char doub_quo[] = "This string \"contains quotes\"";
   #+END_SRC
** Character Math
   #+BEGIN_NOTES
   - As we discussed in session 1, it's important to note that
     characters are still number values, just ones that are
     interpreted specially based on context. Because of this, it's
     still possible to use math operations on them, and potentially
     change the contents of the string.
   - This also gives us the advantage of using comparison operators
     for if we know how to use the ASCII table.
   #+END_NOTES
   #+BEGIN_SRC c
    char c[] = "cars go fast";
    printf("%s\n", c);
    c[2] += 2;
    c[10] -= 1;
    printf("%s\n", c);
   #+END_SRC
   #+BEGIN_SRC c
   if (thing >= 'A' && thing <= 'Z') {
       printf("is captial\n");
   }
   #+END_SRC
* Pointers
** Pointers and Addresses
   #+BEGIN_NOTES
   - It finally comes time to talk about pointers.
   - Pointers are an abstraction around a memory address, and are
     denoted by the asterisk in their declaration.
   - A pointer can be made to point to any valid data type, and points
     to wherever that type begins in memory.
   - We can find the address of a given value by using the address
     operator, represented by the ampersand. This is often used to
     provide an address for a pointer value to point to.
   - The pointer can then be dereferenced once again using the
     asterisk, which provides the value of whatever memory address it
     points to.
   #+END_NOTES
   #+BEGIN_SRC c
   int some_int = 322;
   int *ptr = &some_int;
   printf("some_int is %i, ptr is %i, ptr points to %i\n",
          some_int, ptr, *ptr);
   #+END_SRC
   #+BEGIN_SRC
   some_int is 322, ptr is -486382484, ptr points to 322
   #+END_SRC
