session03/lab03.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Computer Science Fundamentals</title>
<meta name="author" content="(Detroit Labs Dev Coaching)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/league.css" id="theme"/>

<link rel="stylesheet" href="./presentation.css"/>
<link rel="stylesheet" href="./reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Computer Science Fundamentals</h1><h2 class="author">Detroit Labs Dev Coaching</h2><h2 class="date">2018</h2>
</section>

<section>
<section id="slide-orgad8f0c7">
<h2 id="orgad8f0c7">Lab 3</h2>
<aside class="notes">
<ul>
<li>Strings</li>
<li>Pointers</li>
<li>Bit-wise Operations</li>
<li>Enumerations</li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-orgf741259">
<h2 id="orgf741259">Strings</h2>
<div class="outline-text-2" id="text-orgf741259">
</div>
</section>
<section id="slide-org469a5c6">
<h3 id="org469a5c6">Strings vs Chars</h3>
<aside class="notes">
<ul>
<li>You might be familiar with how we designate strings from other
languages, which is done with the double-quote.</li>
<li>As we've seen a few times but have not belabored, this is
distinct from defining a single character, which is done with the
single-quote.</li>
<li>It's important to note that even a single character in a string
is not the same as a char variable definition containing the same
character.</li>
<li>More confounding is that assigning a string to a char variable
will compile, and hopefully we'll understand why that is
acceptable shortly. This does generate a warning but is still a
potential point of confusion.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >"C is weird"  /* string */
'c'           /* char   */
"C"           /* string */

char c = "c"; /* this compiles but probably
                 isn't what you intended!   */
</code></pre>
</div>
</section>
<section id="slide-orgf9e3f42">
<h3 id="orgf9e3f42">Strings are char[]</h3>
<aside class="notes">
<ul>
<li>So, what is the type for a string? We can define a string literal
by placing whatever characters we would like in the string
between double-quotes, but there is no built-in string type in C.</li>
<li>The actual type we need to assign a string literal to is an array
of characters.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >char d[] = "Detroit";
</code></pre>
</div>
</section>
<section id="slide-orge21e9d7">
<h3 id="orge21e9d7">String sizes and '\0'</h3>
<aside class="notes">
<ul>
<li>When we declare a string to be a character array, we're actually
getting a bit of compiler magic to work for us.</li>
<li>When we assign a string to a character array, the compiler adds
an additional null character to the end of the string if there is
room in the array. This null character is used by convention to
mark the end of a string and is used by library functions like
printf to know when to stop functioning on values.</li>
<li>This is why you will usually see string literals defined as a
non-specific size.</li>
<li>If explicitly defining the size of a character array to hold a
string, be sure to leave an additional character's worth of space
in the array's size to take full advantage of the compiler's
special treatment for strings.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >char d[8] = { 'D', 'e', 't', 'r', 'o', 'i', 't', '\0' };
</code></pre>
</div>
</section>
<section id="slide-orgd2d7cdc">
<h3 id="orgd2d7cdc">String Equality</h3>
<aside class="notes">
<ul>
<li>If you're used to more fully-featured languages, you'll be
disappointed to know that comparing strings can't be accomplished
with the equality operator for numbers.</li>
<li>This is because even if they contain the same data, or even the
same first element, arrays will never evaluate as the same from
via the number equality operator.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >char c[] = "cat";
char c2[] = "cat";
if (c == c2) {
    printf("match\n");
}  else {
    printf("no match\n");  /* cannot compare arrays! */
}
</code></pre>
</div>
</section>
<section id="slide-orga0bb7cf">
<h3 id="orga0bb7cf">Null String</h3>
<aside class="notes">
<ul>
<li>This is, of course, except for the null string.</li>
<li>The null string is a string containing only the special null
character, which is the default for an empty string assigned to a
character array of unspecified length. The null string will
compare correctly with a char representing the null character,
which we'll understand more in a moment when we talk about pointers.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >char c[] = "";
char c2 = '\0';
if (c[0] == c2) {
    printf("match\n");
}  else {
    printf("no match\n");
}
</code></pre>
</div>
</section>
<section id="slide-org8123fd7">
<h3 id="org8123fd7">Escape Characters</h3>
<aside class="notes">
<ul>
<li>The null character is not the only special character available,
it is one of several escape characters available, each of which
is prefaced by the backslash.</li>
<li>The backslash itself is an escape character, and thus if we want
to represent a literal backslash in a string, we can do so by
prefacing it with a backslash.</li>
<li>We can also use the backslash to escape a single-quote to
define a character representing a single-quote, or to escape
double-quotes that we would like to show up as literals in a string.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >char newline = '\n';
char about_newline[] = "the newline character is \\n";

char sing_quo = '\'';
char doub_quo[] = "This string \"contains quotes\"";
</code></pre>
</div>
</section>
<section id="slide-orgb55a6a7">
<h3 id="orgb55a6a7">Character Math</h3>
<aside class="notes">
<ul>
<li>As we discussed in session 1, it's important to note that
characters are still number values, just ones that are
interpreted specially based on context. Because of this, it's
still possible to use math operations on them, and potentially
change the contents of the string.</li>
<li>This also gives us the advantage of using comparison operators
for if we know how to use the ASCII table.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >char c[] = "cars go fast";
printf("%s\n", c);
c[2] += 2;
c[10] -= 1;
printf("%s\n", c);
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >if (thing >= 'A' && thing <= 'Z') {
    printf("is captial\n");
}
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org46aca67">
<h2 id="org46aca67">Pointers</h2>
<div class="outline-text-2" id="text-org46aca67">
</div>
</section>
<section id="slide-orgd15d63c">
<h3 id="orgd15d63c">Pointers and Addresses</h3>
<aside class="notes">
<ul>
<li>It finally comes time to talk about pointers.</li>
<li>Pointers are an abstraction around a memory address, and are
denoted by the asterisk in their declaration.</li>
<li>A pointer can be made to point to any valid data type, and points
to wherever that type begins in memory.</li>
<li>We can find the address of a given value by using the address
operator, represented by the ampersand. This is often used to
provide an address for a pointer value to point to.</li>
<li>The pointer can then be dereferenced once again using the
asterisk, which provides the value of whatever memory address it
points to.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >int some_int = 322;
int *ptr = &some_int;
printf("some_int is %i, ptr is %i, ptr points to %i\n",
       some_int, ptr, *ptr);
</code></pre>
</div>
<pre  class="example">
some_int is 322, ptr is -486382484, ptr points to 322
</pre>
</section>
