session03/lab03.org
** Pointers and Complex Data Types
   #+BEGIN_NOTES
   - Again, pointers can be made to point to any valid data type, so
     it's not only acceptable but common to create pointers to complex
     data structures. This is especially common when passing large
     data structure to functions to help maintain efficiency by
     preventing the copying of large amounts of data into a
     function. When passed as pointers, structs then become mutable in
     the same way that arrays are from within a function's body.
   - If a pointer points to a struct, the pointer must first be
     dereferenced before its members can be accessed. Again, this is
     so common that there is an operator dedicated to exactly this
     functionality, the structure pointer operator, more commonly
     known as the right arrow.
   #+END_NOTES
   #+BEGIN_SRC c
   struct time {
       int hour;
       int minute;
   };
   struct time now = { 12, 21 };
   struct time *now_p = &now;

   (*now_p).hour = 13;
   now_p->minute = 31;
   #+END_SRC
** Pointers and Arrays
   #+BEGIN_NOTES
   - In session 2 we learned that passing an array to a function
     actually passes a pointer to the array. Because of this, unlike
     other function arguments, the function body was not given its own
     copy of the array argument and therefore was mutable from the
     context of the array, but also no information about the length of
     the array accompanied array argument, so if the length was
     relevant, we would need to provide that as a separate argument
     ourselves.
   - As we now know, pointers simply point to a memory location. This
     memory location, like every non-complex data type we've
     encountered so far, is represented internally as just another
     number. This means that number can be incremented and
     decremented, and the resulting memory locations can be
     accessed. Deep down, this is all the index of the array is - an
     offset distance of memory locations away from the start of the
     array.
   - Accessing memory locations in the way is actually more efficient
     than using array indices, but this shouldn't tempt you away from
     using the subscript operator with array indices unless you have
     other good reasons.
   - Notice we also don't need the address operator here: the compiler
     recognizes a reference to an array without the use of the
     subscript operator as a pointer by default.
   #+END_NOTES
   #+BEGIN_SRC c
   int nums[] = {1, 2, 3, 4, 5};
   int *n = nums;

   *n          == 1;
   *(n    + 1) == 2;
   *(nums + 2) == 3;
   *(nums + 3) == 4;
   *(nums + 4) == 5;
   #+END_SRC
** Pointers and Arrays
   #+BEGIN_NOTES
   - This is an example of how we can use an array pointer and
     incrementing to access the array elements in a loop.
   #+END_NOTES
   #+BEGIN_SRC c
   int nums[] = {1, 2, 3, 4, 5};
   int i = 0;
   while(i < 5) {
       printf("%i\n", *(nums + i));
       i++;
   }
   #+END_SRC
** Arrays of Strings
   #+BEGIN_NOTES
   - Previously I told you that multi-dimensional arrays needed to be
     of uniform size. That was true at the time given the tools that
     we had at hand. However, now that we have pointers, we can work
     around those limitations.
   - By defining an array of pointers, we still have an array of
     uniform size - 1 pointer per index. However, what those pointers
     point to may be of arbitrary size. Therefore, by pointing to an
     array of pointers instead of an array of arrays, the sub arrays
     can be of undeclared size.
   #+END_NOTES
   #+BEGIN_SRC c
    char *words[] = {"NOT", "4", "CATS"};

    for(int i = 0; i < 3; i++) {
        printf("%s\n", *(words + i));
    }
   #+END_SRC
** Linked Lists
   #+BEGIN_NOTES
   - As we approach the wrap-up of our discussion of pointers, we can
     look at a practical use of pointers. Last session we discussed
     the concept of a linked list data structure and its relative
     merit compared to an array. We now have the tools at hand to
     design this data structure ourselves.
   - A linked list item will be of some value and hold a pointer to
     another item. To link items together, we simply set the pointer
     reference of one item to the address of the item that we intend
     to follow it. If we choose to iterate over the list, we can use
     the handy knowledge that eventually we will come across a null
     pointer (which evaluates to false in a boolean context) as our
     looping condition.
   #+END_NOTES
   #+BEGIN_SRC c
    struct item {
        int value;
        struct item *next;
    };
    struct item first = { .value = 10 };
    struct item second = { .value = 20 };
    first.next = &second;

    struct item new_first = { 5, &first };

    struct item *head = &new_first;
    int i = 0;
    while (head) {
        printf("position %i - %i\n", i, head->value);
        i++;
        head = head->next;
    }
   #+END_SRC
** Pointers and Functions
   #+BEGIN_NOTES
   - While not common in most practical C programs, you may find some
     situations where you will encounter a pointer to a
     function. Often, these may be attached to a struct to mimic
     something along the lines of object-orientation by having a data
     structure carry with it access to the functions that might
     operate on its data, or it may be used for higher-order function
     implementations, such as the C standard library's quicksort
     implementation, qsort.
   #+END_NOTES
   #+BEGIN_SRC c
   int add1(int i) {
       return i + 1;
   }

   int (*f)(int) = &add1;

   int six = (*f)(5);
   #+END_SRC
   #+BEGIN_SRC c
   void qsort(void *base, size_t nitems, size_t size, int (*compar)(const void *, const void*))

   #+END_SRC
* Bit-twiddling
** Byte Layout and Ordering
   #+BEGIN_NOTES
   - While often we use the abstractions provided by the system to
     manipulate numbers in memory, this is not necessarily the optimal
     solution. It could be less memory or speed efficient to do so,
     although those are rarely problems we may come up against as
     application developers on fast, modern systems, and so we are
     often just as happy to accept the abstractions available to get
     our work done.
   - However, there are numerous applications where the ordering of
     specific bits actually matters, and we may not be able to
     reliably depend on the compiler to do what we need. We can see
     here simply by looking at a short integer definition of the
     number 15 - the bytes are reversed on big and little endian
     systems, so if the actual bits in question here are important
     outside of their context as a short int, we can't rely on them!
   - So, we may need to resort to what is known colloquially as
     "bit-twiddling" - that is: manipulating bits directly.
   - This is most common when dealing with low-level programming such
     as low-powered bluetooth or radio programming, or when writing
     systems software that talks directly to hardware.
   - Take for example this completely contrived bit field / byte flag
     / bit mask which shows which of a devices telecommunications
     services are available.
   #+END_NOTES
   #+BEGIN_SRC c
   0x000F = 0b00000000 0b00001111 /* big endian */
          = 0b00001111 0b00000000 /* little endian */
   #+END_SRC
   #+BEGIN_SRC
   BT   GPS_C  FM    4G
   |     |     |     |
   0  0  1  0  0  1  0  1
      |     |     |     |
     NFC  GPS_F  WIFI  CELL
   #+END_SRC
